# ileri toplulaştırma: aggregate,filter,transform,apply

In [2]:
import pandas as pd
df  = pd.DataFrame({"gruplar": ["a","b","c","a","b","c"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [ ]:
#aggregate

In [4]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
a               16        181
b               17        182
c               66        651

In [6]:
import numpy as np
df.groupby("gruplar").aggregate(["min", np.median, max])
#df.groupby("gruplar").aggregate(["min", np.median,"max" ])

        degisken1            degisken2
              min median max       min median  max
gruplar
a              10     16  22       100    181  262
b              11     17  23       111    182  253
c              33     66  99       333    651  969

In [7]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
a               10        262
b               11        253
c               33        969

In [8]:
#filter
#dataframe üzerinde koşul çalıştırmak istiyorum
#fonksiyonumu kendim tanımlamam lazım değişkenleri sorgulamam için filter kullanacağım

In [9]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [12]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
a         8.485281  114.551299
b         8.485281  100.409163
c        46.669048  449.719913

In [10]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       c         33        333
5       c         99        969

In [13]:
#transform

In [14]:
import pandas as pd
df  = pd.DataFrame({"gruplar": ["a","b","c","a","b","c"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [15]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [16]:
#kendi tanımladığımız fonk değişkenler üzerinde gezdirme

In [24]:
df_a = df.iloc[:,1:3]

In [26]:
df_a.transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [29]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [30]:
#transform vektörel çalışan bir fonk

In [31]:
#lambda isimsiz fonk

In [32]:

#apply : tıpkı traansform ve filter gibi değişkenlerin üzerinde gezinme yeteneği olan
#ve aggregate olan toplulaştırma amaçlı kullanılan fonk

In [34]:
import pandas as pd
df  = pd.DataFrame({"degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["degisken1","degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [35]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [36]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [37]:
import pandas as pd
df  = pd.DataFrame({"gruplar": ["a","b","c","a","b","c"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [38]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
a            aa         32        362
b            bb         34        364
c            cc        132       1302

In [39]:
seri = pd.Series([121,200,150,99])

seri.values

array([121, 200, 150,  99], dtype=int64)